of70/tutorials/rheoFoam/OtherTests/Channel2D_VE/XPomPomLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             XPomPomLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
               
                lambdaB          lambdaB [0 0 1 0 0 0 0] .1;
                lambdaS          lambdaS [0 0 1 0 0 0 0] .02;
                alpha            alpha [0 0 0 0 0 0 0] 0.06;
                q                q [0 0 0 0 0 0 0] 5;
                n                n [0 0 0 0 0 0 0] 0;
                
               
                stabilization    coupling;              
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
